# mac-mini Brewfile
# GUI アプリと App Store アプリを管理する。
# CLI ツールは Home Manager (nix) で管理するため、ここには含めない。
#
# 適用: brew bundle --file hosts/mac-mini/Brewfile
# App Store アプリは mas CLI が必要（brew install mas）

brew "mas"

# ブラウザ・クラウド
cask "google-chrome"
cask "google-drive"

# ネットワーク・リモートアクセス
cask "tailscale-app"
cask "windows-app"

# 開発エディタ・ターミナル
cask "ghostty"
cask "zed"
cask "visual-studio-code"
cask "codex-app"
cask "ollama-app"

# コンテナ
cask "docker-desktop"

# 入力デバイス
cask "karabiner-elements"
cask "logi-options+"

# コミュニケーション
cask "slack"
cask "discord"
cask "linear"
cask "zoom"

# クリエイティブ
cask "affinity"
cask "blender"
cask "obs"
# davinci-resolve は公式サイトから手動インストール（Homebrew cask 非対応）
cask "elgato-stream-deck"

# ユーティリティ
cask "raycast"
cask "keycastr"

# フォント
cask "font-meslo-lg-nerd-font"

# App Store アプリ
mas "RunCat", id: 1429033973
mas "Xcode", id: 497799835
mas "GarageBand", id: 682658836
